Revit 2027 API
ReferenceIntersector Properties
The ReferenceIntersector type exposes the following members.
Properties
Name | Description
FindReferencesInRevitLinks |  Determines if references inside Revit Links should be found.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
TargetType |  The type of reference to find.
ViewId |  The id of the 3D view used for evaluation.
Top
See Also
Reference
ReferenceIntersector Class
Autodesk.Revit.DB Namespace